CSI API ETABS v1
cPropMaterial.SetOConcrete Method
 (NEWER FUNCTION AVAILABLE) Sets the other material property data for concrete materials.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOConcrete(
	string Name,
	double Fc,
	bool IsLightweight,
	double FcsFactor,
	int SSType,
	int SSHysType,
	double StrainAtFc,
	double StrainUltimate,
	double FrictionAngle = 0,
	double DilatationalAngle = 0,
	double Temp = 0
)
Function SetOConcrete (
	Name As String,
	Fc As Double,
	IsLightweight As Boolean,
	FcsFactor As Double,
	SSType As Integer,
	SSHysType As Integer,
	StrainAtFc As Double,
	StrainUltimate As Double,
	Optional FrictionAngle As Double = 0,
	Optional DilatationalAngle As Double = 0,
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim Fc As Double
Dim IsLightweight As Boolean
Dim FcsFactor As Double
Dim SSType As Integer
Dim SSHysType As Integer
Dim StrainAtFc As Double
Dim StrainUltimate As Double
Dim FrictionAngle As Double
Dim DilatationalAngle As Double
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.SetOConcrete(Name,
	Fc, IsLightweight, FcsFactor, SSType,
	SSHysType, StrainAtFc, StrainUltimate,
	FrictionAngle, DilatationalAngle,
	Temp)
int SetOConcrete(
	String^ Name,
	double Fc,
	bool IsLightweight,
	double FcsFactor,
	int SSType,
	int SSHysType,
	double StrainAtFc,
	double StrainUltimate,
	double FrictionAngle = 0,
	double DilatationalAngle = 0,
	double Temp = 0
)
abstract SetOConcrete :
        Name : string *
        Fc : float *
        IsLightweight : bool *
        FcsFactor : float *
        SSType : int *
        SSHysType : int *
        StrainAtFc : float *
        StrainUltimate : float *
        ?FrictionAngle : float *
        ?DilatationalAngle : float *
        ?Temp : float
(* Defaults:
        let _FrictionAngle = defaultArg FrictionAngle 0
        let _DilatationalAngle = defaultArg DilatationalAngle 0
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing concrete material property.
Fc
Type: System.Double
IsLightweight
Type: System.Boolean
If this item is True, the concrete is assumed to be lightweight concrete.
FcsFactor
Type: System.Double
SSType
Type: System.Int32
This is 0, 1 or 2, indicating the stress-strain curve type.
Value | SSType
0 | User defined
1 | Parametric - Simple
2 | Parametric - Mander
SSHysType
Type: System.Int32
This is 0 through 7, indicating the stress-strain curve type.
Value | SSHysType
0 | Elastic
1 | Kinematic
2 | Takeda
3 | Pivot
4 | Concrete
5 | BRB Hardening
6 | Degrading
7 | Isotropic
StrainAtFc
Type: System.Double
StrainUltimate
Type: System.Double
This item applies only to parametric stress-strain curves. It is the ultimate unconfined strain capacity. This item must be larger than the StrainAtfc item
FrictionAngle (Optional)
Type: System.Double
The Drucker-Prager friction angle. This item must be smaller or equal to 0 and less than 90. [deg]
DilatationalAngle (Optional)
Type: System.Double
The Drucker-Prager dilatational angle. This item must be smaller or equal to 0 and less than 90. [deg]
Temp (Optional)
Type: System.Double
The temperature at which the specified data applies. The temperature must have been defined previously for the material.
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
Return Value
Type: Int32
Returns zero if the data is successfully assigned; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Concrete", eMatType.Concrete)
   'assign other properties
       ret = SapModel.PropMaterial.SetOConcrete("Concrete", 5, False, 0, 1, 2, 0.0022, 0.0052)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace